dragoptimisation/system/optimisationDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      optimisationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

optimisationManager    steadyOptimisation;

primalSolvers
{
    p1
    {
        active                 true;
        type                   incompressible;
        solver                 simple;
        solutionControls
        {
            nIters 3000;
            residualControl
            {
                "p.*"       1.e-6;
                "U.*"       1.e-6;
            }
        }
    }
}

adjointManagers
{
    am1
    {
        primalSolver             p1;
        adjointSolvers
        {
            as1
            {
                // choose adjoint solver
                //----------------------
                active                 true;
                type                   incompressible;
                solver                 adjointSimple;

                // manage objectives
                //------------------
                objectives
                {
                    type            incompressible;
                    objectiveNames
                    {
                        drag
                        {
                            weight          1.;
                            type            force;
                            patches         (stlSurface);
                            direction       (1 0 0);
                            Aref            1.;
                            rhoInf          1;
                            UInf            10;
                        }
                    }
                }

                // ATC treatment
                //--------------
                ATCModel
                {
                    ATCModel        standard;
                }

                // solution control
                //------------------
                solutionControls
                {
                    nIters 3000;
                    residualControl
                    {
                        "pa.*"       1.e-6;
                        "Ua.*"       1.e-6;
                    }
                }
            }
            // vol
            // {
            //     // choose adjoint solver
            //     //----------------------
            //     active                 true;
            //     type                   null;
            //     isConstraint           true;

            //     // manage objectives
            //     //------------------
            //     objectives
            //     {
            //         type                geometric;
            //         objectiveNames
            //         {
            //             vol
            //             {
            //                 weight          1;
            //                 type            partialVolume;
            //                 patches         (pressure suction);
            //             }
            //         }
            //     }
            // }
        }
    }
}

optimisation
{
    designVariables
    {
        type            shape;
        shapeType       volumetricBSplines;
        sensitivityType shapeFI;
        patches         (stlSurface);
        maxInitChange   5.e-3;
    }
    updateMethod
    {
        method          constraintProjection;
    }
}


// ************************************************************************* //
